osgp/platform/osgp-secret-management/src/integration-test/resources/test-requests/invalidGetSecrets.xml

<soap:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ns="http://www.opensmartgridplatform.org/schemas/security/secretmanagement">
  <soap:Header>
    <ns:correlationUid>123456</ns:correlationUid>
  </soap:Header>
  <soap:Body>
    <ns:getSecretsRequest
      xmlns:ns="http://www.opensmartgridplatform.org/schemas/security/secretmanagement">
      <ns:DeviceId>E0000000000000000</ns:DeviceId>
    </ns:getSecretsRequest>
  </soap:Body>
</soap:Envelope>
