osgp/platform/osgp-secret-management/src/integration-test/resources/test-requests/getSecrets_noStoredSecretType.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:ns="http://www.opensmartgridplatform.org/schemas/security/secretmanagement">
  <soap:Header>
    <ns:correlationUid>123456</ns:correlationUid>
  </soap:Header>
  <soap:Body>
  <ns:getSecretsRequest xmlns:ns="http://www.opensmartgridplatform.org/schemas/security/secretmanagement">
  <ns:DeviceId>E0000000000000000</ns:DeviceId>
  <ns:SecretTypes>
    <ns:SecretType>E_METER_AUTHENTICATION_KEY</ns:SecretType>
    <ns:SecretType>E_METER_MASTER_KEY</ns:SecretType><!-- There is no secret of this type -->
    <ns:SecretType>E_METER_ENCRYPTION_KEY_UNICAST</ns:SecretType>
  </ns:SecretTypes>
</ns:getSecretsRequest>
  </soap:Body>
</soap:Envelope>